IRP/src/ChartsOfCharacteristicTypes/IDInfoTypes/IDInfoTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>IDInfoTypes</name>
  <type>
    <types>CatalogRef.IDInfoAddresses</types>
    <types>String</types>
    <stringQualifiers>
      <length>512</length>
    </stringQualifiers>
  </type>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ShowOnForm</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ReadOnly</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ExternalDataProces</name>
    <attributes>
      <name>Country</name>
      <type>
        <types>CatalogRef.Countries</types>
      </type>
    </attributes>
    <attributes>
      <name>ExternalDataProc</name>
      <type>
        <types>CatalogRef.ExternalDataProc</types>
      </type>
    </attributes>
    <attributes>
      <name>Settings</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>RelatedValues</name>
    <attributes>
      <name>IDInfoType</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.IDInfoTypes</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ChartOfCharacteristicTypes>

IRP/src/ChartsOfCharacteristicTypes/IDInfoTypes/Forms/ItemForm/Module.bsl
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	LocalizationEvents.CreateMainFormItemDescription(ThisObject, "GroupDescriptions");
EndProcedure

&AtClient
Procedure DescriptionOpening(Item, StandardProcessing) Export
	LocalizationClient.DescriptionOpening(Object, ThisObject, Item, StandardProcessing);
EndProcedure

&AtClient
Procedure SetSettings(Command)
	CurrentRow = Items.ExternalDataProces.CurrentData;
	If CurrentRow = Undefined Then
		Return;
	EndIf;
	
	Info = AddDataProcServer.AddDataProcInfo(CurrentRow.ExternalDataProc);
	Info.Insert("Settings", ThisObject.AddressResult);
	Info.Insert("ExternalDataProcRef", CurrentRow.ExternalDataProc);
	Info.Insert("Country", CurrentRow.Country);
	CallMetodAddDataProc(Info);
	
	NotifyDescription = New NotifyDescription("OpenFormAddDataProcEnd", ThisObject);
	AddDataProcClient.OpenFormAddDataProc(Info, NotifyDescription, "Settings");
EndProcedure

&AtServerNoContext
Procedure CallMetodAddDataProc(Info)
	AddDataProcServer.CallMetodAddDataProc(Info);
EndProcedure

&AtClient
Procedure OpenFormAddDataProcEnd(Result, AdditionalParameters) Export
	If Result = Undefined Then
		Return;
	EndIf;
	Modified = True;
	OpenFormAddDataProcEndServer(Result);
EndProcedure

&AtServer
Procedure OpenFormAddDataProcEndServer(Result)
	Obj = FormAttributeToValue("Object");
	Obj.ExternalDataProces[ThisObject.RowNumber - 1].Settings =
		New ValueStorage(Result, New Deflation(9));
	Obj.Write();
	PutToTempStorage(Result, ThisObject.AddressResult);
	ValueToFormAttribute(Obj, "Object");
EndProcedure

&AtClient
Procedure ExternalDataProcesOnActivateRow(Item)
	CurrentRow = Items.ExternalDataProces.CurrentData;
	If CurrentRow = Undefined Then
		Return;
	EndIf;
	PutSettingsToTempStorage(CurrentRow.LineNumber);
EndProcedure

&AtServer
Procedure PutSettingsToTempStorage(LineNumber)
	Obj = FormAttributeToValue("Object");
	Settings = Obj.ExternalDataProces[LineNumber - 1].Settings;
	ThisObject.AddressResult = PutToTempStorage(Settings.Get(), ThisObject.UUID);
	ThisObject.RowNumber = LineNumber;
EndProcedure
